{
  "language": {
    "en": "anglais",
    "fr": "français",
    "switch_lang": "basculer en {lang}"
  },
  "expenseForm": {
    "title": "Ajouter une Dépense",
    "instructions": "Veuillez remplir le formulaire ci-dessous pour suivre vos dépenses. Les champs marqués d'un * sont obligatoires.",
    "description": "Description de l'article",
    "category": "Catégorie de dépenses",
    "datetime": "Date et heure d'achat",
    "date": "Date",
    "time": "Heure",
    "amount": "Montant total dépensé",
    "currency": "Devise de monnaie",
    "location": "Lieu d'achat",
    "save": "Enregistrer",
    "validations": {
      "alpha": "Veuillez entrer uniquement des lettres. Pas de chiffres ni de caractères spéciaux.",
      "between": "La valeur du champ '{property}' doit être entre {min} et {max}.",
      "required": "Veuillez remplir le champ '{property}'. Il est obligatoire.",
      "maxLength": "La saisie ne doit pas dépasser {max} caractères.",
      "notInFuture": "La date doit être aujourd'hui ou dans le passé. Les dates futures ne sont pas autorisées.",
      "minValue": "La valeur du champ '{property}' est trop basse. Elle doit être au moins de {min}.",
      "maxValue": "La valeur du champ '{property}' est trop élevée. Elle ne doit pas dépasser {max}.",
      "numeric": "Veuillez entrer un nombre valide. Les autres caractères ne sont pas autorisés.",
      "isLength": "La saisie doit être exactement de {length} caractères."
    }
  },
  "expense": {
    "successfullySaved": "Hourra! Votre dépense a trouvé sa nouvelle maison dans notre base de données."
  },
  "geolocation": {
    "searchPosition": "Rechercher par adresse",
    "noPermissionTitle": "Aïe! Nous sommes perdus sans vous.",
    "noPermissionSubtitle": "Activez la géolocalisation, et montrez-nous où vous faites pleuvoir les billets."
  },
  "categories": {
    "clothing": "Vêtements",
    "entertainment": "Divertissement",
    "food": "Nourriture",
    "giftDonation": "Cadeau / Don",
    "healthPersonalCare": "Santé / Soins personnels",
    "householdSupply": "Fournitures ménagères",
    "housing": "Logement",
    "personal": "Personnel",
    "transportation": "Transport",
    "utilities": "Utilitaires"
  },
  "errors": {
    "geolocation": {
      "notSupported": "Oh non! Votre appareil ne supporte pas la géolocalisation. Peut-être est-il temps de le changer?",
      "permissionDenied": "Il semble que nous n'ayons pas la permission de voir votre localisation. Pouvez-vous l'activer?",
      "positionUnavailable": "Hmm, nous ne parvenons pas à trouver votre localisation. Vous cachez-vous dans un repaire secret?",
      "timeout": "Nous essayons toujours de vous trouver... mais cela prend plus de temps que prévu. Pouvez-vous vérifier votre connexion?",
      "invalidCoords": "Les coordonnées fournies sont invalides. Cliquez sur l'icône ‘réticule’ ci-dessous pour les mettre à jour.",
      "unknownError": "Quelque chose de mystérieux s'est produit et nous n'avons pas pu obtenir votre localisation. Essayez à nouveau?",
      "defaultMessage": "Une erreur s'est produite lors de la tentative d'obtenir votre localisation."
    },
    "geocoding": {
      "apiRequestFailed": "Aïe! Notre carte semble faire une pause. Pourriez-vous réessayer plus tard?",
      "emptyQuery": "Oups! Il semble que vous avez oublié de nous dire où vous voulez aller."
    },
    "indexedDB": {
      "browserNotSupported": "Oh la la! Votre navigateur ne supporte pas IndexedDB. Peut-être est-il temps de le changer?",
      "storeCreationFailed": "Uh-oh! Nous avons eu du mal à configurer notre stockage. Pourriez-vous réessayer?",
      "databaseNotInitialized": "Oups! Notre base de données n'est pas encore prête. Patience!",
      "itemAdditionFailed": "Aïe! Nous n'avons pas pu sauvegarder cet élément. Pourriez-vous réessayer?",
      "itemRetrievalFailed": "Hmm, nous n'avons pas pu trouver cet élément. Êtes-vous sûr qu'il est là?"
    },
    "expense": {
      "validationFailed": "Oups! Votre dépense a trébuché sur une règle de validation.",
      "notSaved": "Oh non! Votre dépense a décidé de jouer à cache-cache et n'a pas pu être enregistrée."
    }
  }
}
